feat: align with superpower skill structure
